# Pandas Tutorial

## Installation
To install pandas enter
```
pip3 install pandas
```
at a console. Maybe you need sudo. Thats it.

For excel export you need to
```
pip3 install openpyxl
```

For excel import you need to
```
pip3 install xlrd
```

For sql stuff you need to
```
pip3 install sqlalchemy
```

## Usage
To use numpy add the following to the python file

In [1]:
import pandas as pd

In [2]:
data = {
    'Country' : ['Belgium', 'India', 'Brazil'],
    'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
    'Population': [11190846, 1303171035, 207847528]
}
data

{'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847528]}

In [3]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [5]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [6]:
df.loc[0, 'Country']

'Belgium'

In [7]:
df.at[0, 'Country']

'Belgium'

In [8]:
df.iloc[1]

Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object

In [9]:
df.iloc[1,0]

'India'

In [10]:
df.iat[1,0]

'India'

In [46]:
df.iloc[:, 0:2]

     Country  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasilia   207847528

In [34]:
df[2:]

    Country  Population Capital  new_col
2  Brasilia   207847528  Brazil      NaN

In [11]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [12]:
df.columns[0]

'Country'

In [13]:
df[df.columns[0]]

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [14]:
df['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [15]:
df['Population']>200000000

0    False
1     True
2     True
Name: Population, dtype: bool

In [16]:
df[df['Population']>200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [17]:
df.to_csv('pandas.csv')

In [18]:

pd.read_csv('pandas.csv', header=0)

   Unnamed: 0  Country    Capital  Population
0           0  Belgium   Brussels    11190846
1           1    India  New Delhi  1303171035
2           2   Brazil   Brasilia   207847528

In [19]:
# Note: having the file open in excel locks the file -> permission denied
df.to_excel('pandas.xlsx', sheet_name='Sheet1')

In [20]:
import xlrd

In [21]:
xlsx = pd.ExcelFile('pandas.xlsx')
df = pd.read_excel(xlsx, 'Sheet1')
df
# pd.read_excel('pandas.xlsx')

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [22]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [23]:
df.to_sql('myDf', engine)
engine.table_names()

['myDf']

In [24]:
result = engine.execute("select * from myDF")
result.fetchall()

[(0, 'Belgium', 'Brussels', 11190846),
 (1, 'India', 'New Delhi', 1303171035),
 (2, 'Brazil', 'Brasilia', 207847528)]

In [25]:
data = pd.read_sql("SELECT * FROM myDF;", engine)
data

   index  Country    Capital  Population
0      0  Belgium   Brussels    11190846
1      1    India  New Delhi  1303171035
2      2   Brazil   Brasilia   207847528

In [26]:
df[['Capital', 'Country']] = df[['Country', 'Capital']]
df

     Country  Capital  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [27]:
dfh = df.head(2)
dfh

     Country  Capital  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035

In [28]:
dft = df.tail(2)
dft

     Country Capital  Population
1  New Delhi   India  1303171035
2   Brasilia  Brazil   207847528

In [29]:
df['Population'].abs()

0      11190846
1    1303171035
2     207847528
Name: Population, dtype: int64

In [30]:
df = df[['Country','Population','Capital']]
df

     Country  Population  Capital
0   Brussels    11190846  Belgium
1  New Delhi  1303171035    India
2   Brasilia   207847528   Brazil

In [42]:
import numpy as np
df['new_col'] = np.nan
df

c:\program files\python35\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

     Country  Population  Capital  new_col
0   Brussels    11190846  Belgium      NaN
1  New Delhi  1303171035    India      NaN
2   Brasilia   207847528   Brazil      NaN

In [44]:
df['new_col2'] = range(len(df))
df

c:\program files\python35\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

     Country  Population  Capital  new_col  new_col2
0   Brussels    11190846  Belgium      NaN         0
1  New Delhi  1303171035    India      NaN         1
2   Brasilia   207847528   Brazil      NaN         2

In [45]:
s = df.fillna(0)
s

     Country  Population  Capital  new_col  new_col2
0   Brussels    11190846  Belgium      0.0         0
1  New Delhi  1303171035    India      0.0         1
2   Brasilia   207847528   Brazil      0.0         2

In [35]:
df.corr()

            Population  new_col
Population         1.0      NaN
new_col            NaN      NaN

In [36]:
df.cov()

              Population  new_col
Population  4.846034e+17      NaN
new_col              NaN      NaN

In [47]:
df.kurt()

Population   NaN
new_col      NaN
new_col2     NaN
dtype: float64

In [48]:
df.mad()

Population    5.305119e+08
new_col                NaN
new_col2      6.666667e-01
dtype: float64

In [49]:
df.sem()

Population    4.019135e+08
new_col                NaN
new_col2      5.773503e-01
dtype: float64

In [50]:
df.var()

Population    4.846034e+17
new_col                NaN
new_col2      1.000000e+00
dtype: float64